# Напишите программу, которая определит позицию второго
# вхождения строки в списке либо сообщит, что её нет.
# Пример:
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1

s = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
x = "qwe"
c = 0
for i in range(0, len(s)):
    if x == s[i]:
        c += 1
    if c == 2:
        print(i)
        break
if c != 2:
    print(-1)
